In [29]:
import pandas as pd
import numpy as np

In [30]:
people = {
    "first": ["Rifat", "Masum", "Sayem", 'Chris', np.nan, None, 'NA'], 
    "last": ["Muhtasim", "Abdullah", "Ahmed", 'Schafer', np.nan, np.nan, 'Missing'], 
    "email": ["rifatmuhtasim@tavlav.com", "abdullah_masum@gmail.com", "sayem_ahmed@email.com", None, np.nan, 'Anonymous@email.com', "NA"],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [31]:
df_people = pd.DataFrame(people)

df_people.replace("NA", np.nan, inplace=True)
df_people.replace("Missing", np.nan, inplace=True)

df_people

   first      last                     email   age
0  Rifat  Muhtasim  rifatmuhtasim@tavlav.com    33
1  Masum  Abdullah  abdullah_masum@gmail.com    55
2  Sayem     Ahmed     sayem_ahmed@email.com    63
3  Chris   Schafer                      None    36
4    NaN       NaN                       NaN  None
5   None       NaN       Anonymous@email.com  None
6    NaN       NaN                       NaN   NaN

In [32]:
## Remove Rows that have missing value
df_people.dropna()

## Drop the Row if there are no email address
df_people.dropna(axis="index", how="all", subset=["email"])

   first      last                     email   age
0  Rifat  Muhtasim  rifatmuhtasim@tavlav.com    33
1  Masum  Abdullah  abdullah_masum@gmail.com    55
2  Sayem     Ahmed     sayem_ahmed@email.com    63
5   None       NaN       Anonymous@email.com  None

In [33]:
## Check the NA value in the dataset
df_people.isna()

## Fillup the NAN Value
df_people.fillna(0)

   first      last                     email age
0  Rifat  Muhtasim  rifatmuhtasim@tavlav.com  33
1  Masum  Abdullah  abdullah_masum@gmail.com  55
2  Sayem     Ahmed     sayem_ahmed@email.com  63
3  Chris   Schafer                         0  36
4      0         0                         0   0
5      0         0       Anonymous@email.com   0
6      0         0                         0   0

In [34]:
## Change the data type for age value

df_people['age'] = df_people['age'].astype(float)
df_people.dtypes # Show the data types

first     object
last      object
email     object
age      float64
dtype: object

## For Stackoverflow Dataset

In [35]:
import pandas as pd

In [37]:
na_vals = ["NA", "MISSING"]
df = pd.read_csv("../../data/survey_results_public.csv", index_col="Respondent")
schema_df = pd.read_csv("../../data/survey_results_schema.csv", index_col="Column")

In [41]:
## Show the Unique value 
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [46]:
df.replace('Less than 1 year', 0, inplace=True)
df.replace('More than 50 years', 55, inplace=True)
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 0, '30', '9', '26', '40', '19', '15', '20', '28',
       '25', '1', '22', '11', '33', '50', '41', '18', '34', '24', '23',
       '42', '27', '21', '36', '32', '39', '38', '31', '37', 55, '29',
       '44', '45', '48', '46', '43', '47', '49'], dtype=object)

In [47]:
df['YearsCode'] = df["YearsCode"].astype(float)

In [48]:
df['YearsCode'].mean()

11.66784552753076